name: "VGG_CNN_M_2048"
layer {
  name: "data"
  type: "HDF5Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  hdf5_data_param {
    source: "/home/npellejero/tesis/AMFED/redes/txtFiles/fer2013/train/list.txt"
    #source: "/home/npellejero/tesis/AMFED/redes/txtFiles/cohnKanadeAlign/train/list.txt"
    #source: "/home/npellejero/tesis/AMFED/redes/txtFiles/cohnKanade/train/list.txt"
    #source: "/home/npellejero/tesis/AMFED/redes/txtFiles/afew/train/list.txt"
    #source: "/home/npellejero/tesis/AMFED/redes/txtFiles/cropClean127WTest/train/list.txt"
    #source: "/home/npellejero/tesis/AMFED/redes/txtFiles/genkis4k/train/list.txt"
    batch_size: 250
  }
}
layer {
  name: "data"
  type: "HDF5Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  hdf5_data_param {
    source: "/home/npellejero/tesis/AMFED/redes/txtFiles/fer2013/val/list.txt"
    #source: "/home/npellejero/tesis/AMFED/redes/txtFiles/cohnKanadeAlign/val/list.txt"
   # source: "/home/npellejero/tesis/AMFED/redes/txtFiles/cohnKanade/val/list.txt"
    #source: "/home/npellejero/tesis/AMFED/redes/txtFiles/genkis4k/test/list.txt"
    #source: "/home/npellejero/tesis/AMFED/redes/txtFiles/cropClean127WTest/test/list.txt"
    #source: "/home/npellejero/tesis/AMFED/redes/txtFiles/afew/val/list.txt"
    batch_size: 250
  }
}
#layer {
#  name: "slicer_label"
#  type: "Slice"
#  bottom: "label"
#  top: "smile"
#  top: "rest"
#  slice_param {
#    axis: 1
#    slice_point: 1
#  }
#}
layer {
  bottom: "data"
  top: "Bnorm1"
  name: "Bnorm1"
  type: "BatchNorm"
  batch_norm_param {
  use_global_stats: false
  }
  param {
  lr_mult: 0
   }
  param {
    lr_mult: 0
  }
  param {
  lr_mult: 0
  }
}
layer {
  bottom: "Bnorm1"
  top: "conv1"
  name: "conv1"
  type: "Convolution"
 param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
      weight_filler {
      type: "gaussian"
     # type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
		num_output: 96
    kernel_size: 7
    stride: 2
  }
}
layer {
  bottom: "conv1"
  top: "conv1"
  name: "relu1"
  type: "ReLU"
}
layer {
  bottom: "conv1"
  top: "norm1"
  name: "norm1"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  bottom: "norm1"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool1"
  top: "Bnorm2"
  name: "Bnorm2"
  type: "BatchNorm"
  batch_norm_param {
  use_global_stats: false
  }
  param {
  lr_mult: 0
   }
  param {
    lr_mult: 0
  }
  param {
  lr_mult: 0
  }
}

layer {
  bottom: "Bnorm2"
  top: "conv2"
  name: "conv2"
  type: "Convolution"
 param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
      weight_filler {
      type: "gaussian"
     # type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    num_output: 256
    pad: 1
    kernel_size: 5
    stride: 2
  }
}
layer {
  bottom: "conv2"
  top: "conv2"
  name: "relu2"
  type: "ReLU"
}
layer {
  bottom: "conv2"
  top: "norm2"
  name: "norm2"
  type: "LRN"
  lrn_param {
    local_size: 5
    alpha: 0.0005
    beta: 0.75
    k: 2
  }
}
layer {
  bottom: "norm2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "Bnorm3"
  name: "Bnorm3"
  type: "BatchNorm"
  batch_norm_param {
  use_global_stats: false
  }
  param {
  lr_mult: 0
   }
  param {
    lr_mult: 0
  }
  param {
  lr_mult: 0
  }
}

layer {
  bottom: "Bnorm3"
  top: "conv3"
  name: "conv3"
  type: "Convolution"
 param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
     weight_filler {
      type: "gaussian"
     # type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3"
  top: "conv3"
  name: "relu3"
  type: "ReLU"
}
layer {
  bottom: "conv3"
  top: "conv4"
  name: "conv4"
  type: "Convolution"
 param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    weight_filler {
      type: "gaussian"
     # type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4"
  top: "conv4"
  name: "relu4"
  type: "ReLU"
}
layer {
  bottom: "conv4"
  top: "conv5"
  name: "conv5"
  type: "Convolution"
 param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
      weight_filler {
      type: "gaussian"
     # type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5"
  top: "conv5"
  name: "relu5"
  type: "ReLU"
}
layer {
  bottom: "conv5"
  top: "pool5"
  name: "pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool5"
  top: "Bnorm4"
  name: "Bnorm4"
  type: "BatchNorm"
  batch_norm_param {
  use_global_stats: false
  }
  param {
  lr_mult: 0
   }
  param {
    lr_mult: 0
  }
  param {
  lr_mult: 0
  }
}

#layer {
 # bottom: "pool5"
  #top: "fc6_scratch"
  #name: "fc6_scratch"
  #type: "InnerProduct"
  #inner_product_param {
  #  num_output: 4096
  #}
#}
#layer {
#  bottom: "fc6_scratch"
#  top: "fc6_scratch"
#  name: "relu6"
#  type: "ReLU"
#}
#layer {
 # bottom: "fc6_scratch"
 # top: "fc6_scratch"
 # name: "drop6"
 # type: "Dropout"
 # dropout_param {
 #   dropout_ratio: 0.5
 # }
#}
#layer {
#  bottom: "fc6_scratch"
#  top: "fc7"
#  name: "fc7"
#  type: "InnerProduct"
#  inner_product_param {
#    num_output: 2048
#  }
#}
#layer {
#  bottom: "fc7"
#  top: "fc7"
#  name: "relu7"
#  type: "ReLU"
#}
#layer {
#  bottom: "fc7"
#  top: "fc7"
#  name: "drop7"
#  type: "Dropout"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#}
layer {
  bottom: "Bnorm4"
  top: "fc8_s"
  name: "fc8_s"
  type: "InnerProduct"
  inner_product_param {
    num_output: 7
 }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc8_s"
  bottom: "label"
  top: "loss"
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc8_s"
  bottom: "label"
  top: "accuracy"
}

