name: "AlexNet"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
	transform_param {
    mean_file: "/home/npellejero/tesis/AMFED/redes/singleLeveldb/mean.binaryproto"
  }
  data_param {
    source: "/home/npellejero/tesis/AMFED/redes/miniBDSingleLMDB/xabcimage-lmdb"
    batch_size: 500
    backend: LMDB
  }
  include: { phase: TRAIN }
}


layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "/home/npellejero/tesis/AMFED/redes/miniBDSingleLMDB/xaaimage-lmdb"
    batch_size: 100
    backend: LMDB
  }
	include: { phase: TEST }
}


layer {
  name: "fc8"
  type: "InnerProduct"
  bottom: "data"
  top: "fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc8"
  bottom: "label"
  top: "loss"
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy"
}
